In [5]:
import pandas as pd

# Excel mit verschiedenen sheets einlesen

In [16]:
df = pd.read_excel(
    'store_data.xlsx',
    sheet_name='purchases', #liest das sheet purchases ein
)

In [17]:
df.head()

,Unnamed: 0,Unnamed: 1,PRODUCT INFORMATION,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
1,2021-10-11 00:00:00,4576,11,Gray Sweater,59.99,No
2,2020-11-13 00:00:00,9488,32,Running Shoes,49.99,Yes
3,2020-08-20 00:00:00,7265,3,Blue Jeans,49.99,Yes
4,2021-04-07 00:00:00,8555,39,Polo Shirt,29.99,No

# Excel einlesen vom URL
Der normale Link sieht so aus: "https://github.com/kimfetti/Videos/blob/master/Pandas_Tips/data/store_data.xlsx"
Ich musste hier am ende des Links "?raw=True" hinzufügen, sonst kann es pandas nicht einlesen

In [23]:
df_url = pd.read_excel(
    'https://github.com/kimfetti/Videos/blob/master/Pandas_Tips/data/store_data.xlsx?raw=True',
    sheet_name='purchases'
)

# Zeilen überspringen

In [28]:
df_1 = pd.read_excel(
    'store_data.xlsx',
    sheet_name='purchases', #liest das sheet purchases ein
    skiprows=1, #anzahl Zeilen überspringen
)

In [26]:
df_1.head()

,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
0,2021-10-11 00:00:00,4576.0,11.0,Gray Sweater,59.99,No
1,2020-11-13 00:00:00,9488.0,32.0,Running Shoes,49.99,Yes
2,2020-08-20 00:00:00,7265.0,3.0,Blue Jeans,49.99,Yes
3,2021-04-07 00:00:00,8555.0,39.0,Polo Shirt,29.99,No
4,2022-01-10 00:00:00,7023.0,44.0,Sweatshirt,49.99,No

# letzte spalten überspringen

In [29]:
df_1.tail()

,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
1814,2022-11-02 00:00:00,9176.0,54.0,Casual Dress,69.99,No
1815,2023-05-12 00:00:00,8588.0,30.0,Maxi Skirt,39.99,No
1816,2021-12-28 00:00:00,1892.0,27.0,Leather Jacket,"1,119.99",Yes
1817,2022-12-25 00:00:00,7437.0,24.0,Cargo Shorts,22.99,No
1818,TOTAL,NaN,NaN,NaN,95545.33,NaN

In [31]:
df_2 = pd.read_excel(
    'store_data.xlsx',
    sheet_name='purchases', #liest das sheet purchases ein
    skiprows=1, #anzahl Zeilen überspringen
    skipfooter=1, #anzahl letzte Spalten überspringen
)

In [32]:
df_2.tail()

,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
1813,2020-01-26,1110,14,Plaid Shorts,22.99,Yes
1814,2022-11-02,9176,54,Casual Dress,69.99,No
1815,2023-05-12,8588,30,Maxi Skirt,39.99,No
1816,2021-12-28,1892,27,Leather Jacket,"1,119.99",Yes
1817,2022-12-25,7437,24,Cargo Shorts,22.99,No

# Grosse zahlen als zahlen erkennen und nicht als strings

In [33]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1818 entries, 0 to 1817
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date of Purchase     1818 non-null   datetime64[ns]
 1   Customer ID          1818 non-null   int64
 2   Product ID           1818 non-null   int64
 3   Product Description  1818 non-null   object
 4   Cost                 1818 non-null   object
 5   Online               1818 non-null   object
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 85.3+ KB

In [39]:
df_3 = pd.read_excel(
    'store_data.xlsx',
    sheet_name='purchases', #liest das sheet purchases ein
    skiprows=1, #anzahl Zeilen überspringen
    skipfooter=1, #anzahl letzte Spalten überspringen
    thousands=',', #wenn Kommas in den Zahlen sind, soll pandas trotzdem als Zahl anstelle von string erkennen
)

In [40]:
df_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1818 entries, 0 to 1817
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date of Purchase     1818 non-null   datetime64[ns]
 1   Customer ID          1818 non-null   int64
 2   Product ID           1818 non-null   int64
 3   Product Description  1818 non-null   object
 4   Cost                 1818 non-null   float64
 5   Online               1818 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 85.3+ KB

In [41]:
df_3.tail()

,Date of Purchase,Customer ID,Product ID,Product Description,Cost,Online
1813,2020-01-26,1110,14,Plaid Shorts,22.99,Yes
1814,2022-11-02,9176,54,Casual Dress,69.99,No
1815,2023-05-12,8588,30,Maxi Skirt,39.99,No
1816,2021-12-28,1892,27,Leather Jacket,1119.99,Yes
1817,2022-12-25,7437,24,Cargo Shorts,22.99,No

# Booleans nach true oder false ändern

In [42]:
df_3.Online.value_counts()

Online
No     918
Yes    900
Name: count, dtype: int64

In [43]:
df_4 = pd.read_excel(
    'store_data.xlsx',
    sheet_name='purchases', #liest das sheet purchases ein
    skiprows=1, #anzahl Zeilen überspringen
    skipfooter=1, #anzahl letzte Spalten überspringen
    thousands=',', #wenn Kommas in den Zahlen sind, soll pandas trotzdem als Zahl anstelle von string erkennen
    true_values=['Yes'],
    false_values=['No'], #macht booleans daraus um es besser zu zählen
)

In [44]:
df_4.head()

  Date of Purchase  Customer ID  Product ID Product Description   Cost  Online
0       2021-10-11         4576          11        Gray Sweater  59.99   False
1       2020-11-13         9488          32       Running Shoes  49.99    True
2       2020-08-20         7265           3          Blue Jeans  49.99    True
3       2021-04-07         8555          39          Polo Shirt  29.99   False
4       2022-01-10         7023          44          Sweatshirt  49.99   False

In [45]:
df_4.Online.value_counts()

Online
False    918
True     900
Name: count, dtype: int64

In [46]:
df_4.Online.sum()

np.int64(900)